facebook/app/controllers/posts_controller.rb

  def create
    @post = current_user.created_posts.build(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "creator_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "TITANIC"], ["content", "Titanic tragedy "], ["created_at", "2019-08-28 08:31:46.190478"], ["updated_at", "2019-08-28 08:31:46.190478"], ["creator_id", 64]]

  def index
    @pagy, @posts = pagy_array(Post.all.sort_by { |home_post| home_post.created_at }.reverse) if user_signed_in?
---
SELECT "posts".* FROM "posts"

  def destroy
    @post = Post.find_by_id(params[:id])
    if @post.creator == current_user
      if @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 242], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 242]]