facebook/app/controllers/users_controller.rb

  def show
    @user = User.find_by_id(params[:format])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 64], ["LIMIT", 1]]